#include "menu.h"
#include <iostream>

namespace ui
{
    void ShowMainMenu()
    {
        std::cout << "命令行工具箱 V1.0.0 " << "\n";
        std::cout << "======================================== " << "\n";
        std::cout << "欢迎使用命令行工具箱程序，请输入对应数字选择你想要使用的功能：" << "\n\n";
        std::cout << "===== 文件操作模块 =====" << "\n";
        std::cout << " 1 - 单个文件重命名" << "\n";
        std::cout << " 2 - 批量重命名（前缀/后缀替换、序号自增重命名）" << "\n";
        std::cout << " 3 - 正则匹配文件名替换" << "\n";
        std::cout << " 4 - 文件筛选与格式转换（按后缀过滤、文本编码转换）" << "\n\n";

        std::cout << "===== 文件哈希校验模块 =====" << "\n";
        std::cout << " 5 - 重复文件查找（MD5哈希识别内容完全一致的重复文件）" << "\n";
        std::cout << " 6 - MD5校验工具（单文件/目录批量计算MD5，生成校验清单）" << "\n\n";

        std::cout << "===== 程序控制 =====" << "\n";
        std::cout << " 0 - 退出程序" << "\n";
        std::cout << "======================================== " << "\n";
    }
}  // namespace ui
